// Крестьянин, разбойник, снайпер, колдун, копейщик, арбалетчик, монах. Для каждого сформировать список свойств и возможных действий. 
// Напрнимер свойство скорость, действие нанести удар. Проанализировать получившиеся свойства и действия персонажей и создать Обобщённый класс 
// описывающий свойства и действия имеющиеся у всех персонажей. Создать этот класс. Создать классы для каждого типа персонажей наследующие и расширяющие
//  абстрактный(обобщённый) класс. В основной программе создать по одному экземпляру каждого типа персонажей.
public class Main {
    public static void main(String[] args) {
        Fermer fermer1 = new Fermer("Ivan", 100, 1, 20);
        Bandit bandit1 = new Bandit("Igor", 200, 20, 20);
        Crossbowman crossbowman1 = new Crossbowman("Yura", 230, 35,10);
        Mag mag1 = new Mag("Anna", 100, 10, 30);
        Monk monc1 = new Monk("Dima",100, 1, 15);
        Snaiper snaiper1 = new Snaiper("Irina", 50, 50, 10);
        Spearman spearman1 = new Spearman("Vasya", 100, 35, 20);
    }
}
